Hi @edudppaz,

What version of the provider are you using? I just tested this with 1.4.0 and do not see this behaviour.

```
 resource "mso_schema_template_bd" "abr_bd" {
  schema_id              = "67f3d6f2c7d23c9888c48744"
  template_name          = "template"
  name                   = "testBD"
  display_name           = "test"
  vrf_name               = "vrf1"
  description = "testing"
  arp_flooding = true
}
```

output

```
9d7f0ed319dd:/test/mso# tfaa
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ciscodevnet/aci in /usr/local/go/bin
│  - ciscodevnet/mso in /usr/local/go/bin
│  - cisco/ndfc in /usr/local/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # mso_schema_template_bd.abr_bd will be created
  + resource "mso_schema_template_bd" "abr_bd" {
      + arp_flooding                    = true
      + description                     = "testing"
      + dhcp_policy                     = (known after apply)
      + display_name                    = "test"
      + ep_move_detection_mode          = (known after apply)
      + id                              = (known after apply)
      + intersite_bum_traffic           = (known after apply)
      + ipv6_unknown_multicast_flooding = (known after apply)
      + layer2_stretch                  = (known after apply)
      + layer2_unknown_unicast          = (known after apply)
      + layer3_multicast                = (known after apply)
      + multi_destination_flooding      = (known after apply)
      + name                            = "testBD"
      + optimize_wan_bandwidth          = (known after apply)
      + schema_id                       = "67f3d6f2c7d23c9888c48744"
      + template_name                   = "template"
      + unicast_routing                 = (known after apply)
      + unknown_multicast_flooding      = (known after apply)
      + virtual_mac_address             = (known after apply)
      + vrf_name                        = "vrf1"
      + vrf_schema_id                   = (known after apply)
      + vrf_template_name               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
mso_schema_template_bd.abr_bd: Creating...
mso_schema_template_bd.abr_bd: Creation complete after 1s [id=testBD]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
9d7f0ed319dd:/test/mso# tfp
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ciscodevnet/mso in /usr/local/go/bin
│  - cisco/ndfc in /usr/local/go/bin
│  - ciscodevnet/aci in /usr/local/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
mso_schema_template_bd.abr_bd: Refreshing state... [id=testBD]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
9d7f0ed319dd:/test/mso# 
```
